<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\City;
use App\Models\Country;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $data = [
            // دول الجوار
            'SY' => ['دمشق', 'حلب', 'حمص', 'حماة', 'اللاذقية', 'طرطوس', 'دير الزور', 'الحسكة', 'القامشلي', 'إدلب', 'السويداء', 'درعا', 'ريف دمشق', 'منبج', 'البوكمال'],
            'TR' => ['إسطنبول', 'أنقرة', 'غازي عنتاب', 'مرسين', 'أنطاليا', 'أضنة', 'اورفا', 'بورصة'],
            'LB' => ['بيروت', 'طرابلس', 'صيدا'],
            'JO' => ['عمان', 'إربد', 'الزرقاء'],
            'EG' => ['القاهرة', 'الإسكندرية'],
            'IQ' => ['بغداد', 'أربيل', 'البصرة'],

            // دول الخليج العربي
            'SA' => ['الرياض', 'جدة', 'الدمام', 'مكة المكرمة'],
            'AE' => ['دبي', 'أبو ظبي', 'الشارقة', 'عجمان'],
            'KW' => ['الكويت العاصمة', 'الجهراء'],
            'QA' => ['الدوحة', 'الريان'],
            'OM' => ['مسقط', 'صلالة'],

            // أوروبا
            'DE' => ['برلين', 'هامبورغ', 'ميونخ', 'إيسن', 'دورتموند'],
            'SE' => ['ستوكهولم', 'غوتنبرغ'],
            'NL' => ['أمستردام', 'روتردام'],
            'AT' => ['فيينا', 'سالزبورغ'],
            'FR' => ['باريس', 'ليون'],
            'GR' => ['أثينا', 'تيسالونيكي'],

            // الأمريكتين
            'US' => ['نيويورك', 'لوس أنجلوس', 'شيكاغو'],
            'CA' => ['تورونتو', 'مونتريال', 'فانكوفر'],
            'BR' => ['ساو باولو', 'ريو دي جانيرو'],
        ];

        foreach ($data as $countryCode => $cities) {
            // جلب ID الدولة بناءً على الكود
            $country = Country::where('code', $countryCode)->first();

            if ($country) {
                foreach ($cities as $cityName) {
                    City::updateOrCreate(
                        ['name' => $cityName, 'country_id' => $country->id],
                        ['name' => $cityName]
                    );
                }
            }
        }
    }
}